<script setup>
import AuthenticatedLayout from '@/Layouts/AuthenticatedLayout.vue';




</script>

<template>


  <AuthenticatedLayout>


    <div class="py-12">
      <div class="max-w-7xl mx-auto sm:px-6 lg:px-8">
        <div class="bg-white overflow-hidden shadow-sm sm:rounded-lg">
          <div class="section-wrap">
            <div class="w-3/4 mx-auto">
              <div class="mb-4">
                <br>
                <h3 class="main-title">Пользовательское соглашение</h3>
              </div>
              <div class="agreement-wrap">
                <h3> Условия использования сайта # </h3><br>
                <h4> 1. Термины и определения</h4><br>
                Сайт – Интернет-ресурс, расположенный в сети Интернет по адресу https://#.ru. Под Сайтом в
            зависимости от контекста понимается также программное обеспечение Сайта, дизайн (графическое оформление)
            Сайта, База данных Сайта, любой его раздел и подраздел (поддомен), а также информация, размещенная на Сайте Администрацией Сайта.
            Администрация сайта – администрация (владельцы) сайта #.ru, которым принадлежат все соответствующие исключительные имущественные права
            на Сайт, включая права на доменное имя Сайта, и осуществляющее его администрирование. Пользователь – лицо, прошедшее Процедуру регистрации,
            получившее индивидуальный логин и/или пароль, а также имеющее свой Профиль. Для целей Пользовательского соглашения под Пользователем
            понимается также лицо, которое не прошло Процедуру регистрации, но осуществляет доступ к Сайту и/или использует и/или использовало его.
            Любое лицо, осуществляющее доступ к Сайту, этим автоматически подтверждает, что оно полностью согласно с положениями Пользовательского
            соглашения, и что в отношении него применимы требования, установленные Пользовательским соглашением.
            Профиль Пользователя / Профиль – специальный подраздел Сайта, где расположена личная информация о Пользователе, а также другая информация,
            разместить которую может только этот Пользователь. Информация – любые сведения, сообщения, данные независимо от формы их представления,
            размещаемые Пользователем на Сайте, в том числе: персональные данные Пользователей, ссылки на другие сайты, любые текстовые сообщения,
            фотографии (изображения), аудио-и/или видео-произведения, компьютерные программы, и др. файлы. База данных – это объективная форма
            предоставления и организации совокупных данных, систематизированных таким образом, чтобы эти данные могли быть найдены и обработаны
            с помощью программно-аппаратных и технических средств Сайта. Спам – массовые, несанкционированные и/или неожидаемые получателями почтовые и
            другие рассылки рекламного, информационного, агитационного или иного характера. Любые термины и понятия, применяемые в условиях использования
            сайта #.ru и не нашедшие отражения в разделе «Термины и определения», будут толковаться в соответствии со
            смыслом, вытекающим из текста условий использования сайта #.ru. В случае возникновения любых разногласий
            относительно толкования термина и/или понятия, применяемого в условиях использования сайта #.ru,
            применяться будет то толкование, которое будет определено Администрацией Сайта.<br>
                <br><h4> 2. Использование Сайта </h4><br>
            2.1. Использование Сайта Пользователем допускается только в соответствии с настоящим Соглашением и исключительно способами,
            предусмотренными техническими возможностями Сайта. <br>
            2.2. Данный сайт предназначен для пользователей старше 12 лет. <br>
            2.3. Правообладателями в отношении Информации, размещенной на Сайте, являются в соответствующих случаях Администрация сайта,
            Пользователи и/или третьи лица. <br>
            2.4. Администрация сайта является законным правообладателем и ей принадлежат все исключительные имущественные и иные
            соответствующие права на Сайт, в том числе, но, не ограничиваясь перечисленным, на программное обеспечение Сайта, графику,
            дизайн, Базу данных Сайта. <br>
            2.5. Любая Информация, размещаемая на Сайте Пользователем, соответственно, принадлежит такому Пользователю или соответствующему
            третьему лицу. Размещая Информацию на Сайте, Пользователь подтверждает, что он обладает всеми необходимыми для этого правами и
            полномочиями, также Пользователь соглашается с тем, что такая Информация становится доступной для Пользователей Сайта.
            Персональные данные пользователей обрабатываются в соответствии с политикой в отношении обработки
            персональных данных на сайте #.ru. <br>
            2.6. Размещая Информацию на Сайте, Пользователь автоматически безвозмездно, безусловно и безотзывно предоставляет Администрации Сайта неисключительное право на использование такой Информации
            по усмотрению Администрации Сайта в том числе, но не ограничиваясь, на воспроизведение, копирование, подбор, систематизацию,
            преобразование, изменение, редактирование, перевод, опубликование, распространение такой Информации (частично или полностью)
            любыми законными способами. Также, размещая Информацию на Сайте, Пользователь подтверждает, что обладает соответствующими правами
            и полномочиями для предоставления Администрации Сайта указанного выше неисключительного права на использование размещенной
            Информации. <br>
            2.7. Контент, созданный Пользователем, автоматически удаляется при отсутствии пользователя на сайте более 2 (двух) лет. <br>
            2.8. Пользователь не имеет права (если только иное прямо не разрешено сервисами Сайта) каким-либо образом изменять, копировать,
            стирать, сохранять, выкачивать, распространять, передавать, продавать, «постить» и иным образом использовать Информацию,
            размещенную на Сайте (за исключением той Информации, которая была законно размещена на Сайте самим Пользователем) без
            предварительного разрешения Администрации Сайта и/или соответствующего правообладателя, кроме случаев, когда Администрация
            сайта и/или правообладатель явным образом выразили свое согласие на свободное использование Информации любым лицом. <br>
            2.9. Пользователи обязуются использовать Информацию, а также любую иную информацию, содержащуюся на Сайте только в личных
            некоммерческих целях, за исключением случаев, когда разрешение на иное использование дано Администрацией Сайта и/или
            соответствующими правообладателями.
            <h4> 3. Функционирование Сайта и ответственность при его использовании </h4><br>
            3.1. Администрация сайта старается обеспечить надлежащее функционирование Сайта в круглосуточном режиме, однако Администрация
            сайта не несет никакой ответственности, если произойдут какие-либо нарушения в работе Сайта по любым причинам. <br>
            3.2. Администрация сайта не гарантирует, что Информация, размещенная на Сайте, будет доступна в любое время, или не будет удалена
            или утеряна. <br>
            3.3. Администрация сайта не несет ответственности за сбои и задержки в работе Сайта, а также за возможные последствия таких
            сбоев и задержек. <br>3.4. Администрация сайта не несет ответственности за возможную утечку Информации из Базы данных Сайта по
            любым причинам, в том числе в результате несанкционированных действий третьих лиц. <br>
            3.5. Администрация сайта не несет ответственности за наличие на Сайте вирусов, а также за возможные последствия заражения
            компьютера Пользователя вирусами или попадание на компьютер Пользователя иных вредоносных программ. <br>
            3.6. Администрация сайта предоставляет Сайт Пользователю «как есть» без каких-либо дополнительных гарантий. <br>3
            .7. Администрация сайта не отвечает, не возмещает и не несет ответственности за любые убытки, включая упущенную выгоду,
            моральный и иной вред, причиненные Пользователю или третьим лицам в результате использования ими Сайта или в связи с
            функционированием Сайта, а также во всех иных случаях, предусмотренных настоящими условиями использования
            сайта #.ru. <br>
            3.8. Пользователь самостоятельно несет полную ответственность за размещаемую им на Сайте и/или сообщаемую им другим
            Пользователям или третьим лицам по средством Сайта Информацию, в том числе, за ее содержание и соответствие требованиям
            законодательства РФ, за нарушение прав третьих лиц на размещаемую и/или сообщаемую Пользователем Информацию
            (в том числе, но не ограничиваясь, прав автора и/или смежных прав, прав на средства индивидуализации, прав на коммерческую
            тайну и других охраняемых законом прав). Пользователь самостоятельно возмещает любые убытки (в том числе упущенную выгоду,
            моральный и иной вред), возникшие у других Пользователей, третьих лиц или Администрации Сайта вследствие указанных нарушений
            и/или размещения на Сайте такой Информации, и/или сообщения посредством Сайта такой Информации, а также совершения иных
            действий в связи с использованием Сайта. <br>
            3.9. Администрация сайта не несет ответственности по договорам между Пользователями и/или Пользователем и любыми третьими
            лицами, заключенным с использованием Сайта. <br>
            3.10. Пользователь обязуется своими силами и за свой счет разрешать
            все споры и урегулировать все претензии и иски третьих лиц, предписания и требования уполномоченных государственных органов
            власти, поступившие как в адрес Пользователя, так и в адрес Администрации Сайта, в связи с размещением Пользователем Информации
            на Сайте, а также возместить все убытки и расходы, понесенные Администрацией Сайта в связи с такими претензиями и исками. <br>
            3.11. Администрация сайта не производит возврат средств, полученных от Пользователя за доступ к платному сайта (за исключением
            случаев, обозначенных в конкретном предложении). Платный контент сайта является цифровым контентом. И приобретаются не по
            договорам купли-продажи или возмездного оказания услуг, а по лицензионному договору (настояшему соглашению).
            Покупая премиум контент сайта, вы получаете лишь право его использования на обозначенных в настоящем соглашении условиях -
            использовать его в личных некоммерческих целях. <h4>
              4. Регистрация на сайте #.ru </h4><br>
            4.1. Регистрация Пользователя на Сайте является бесплатной и
            добровольной. <br>
            4.2. Пользователем Сайта является физическое лицо, зарегистрированное на Сайте в соответствии с установленным настоящими
            Правилами порядком, достигшее возраста, допустимого в соответствии с законодательством Российской Федерации для акцепта
            настоящих Правил, и обладающее соответствующими полномочиями. <br>
            4.3. При регистрации на Сайте Пользователь обязан предоставить Администрации Сайта необходимую достоверную и актуальную
            информацию для формирования персональной страницы Пользователя, включая уникальные для каждого Пользователя логин
            (адрес электронной почты) и пароль доступа к Сайту, а также фамилию и имя. Регистрационная форма Сайта может запрашивать у
            Пользователя дополнительную информацию. <br>
            4.4. Пользователь несет ответственность за достоверность, актуальность, полноту и соответствие законодательству Российской
            Федерации предоставленной при регистрации информации, и ее чистоту от претензий третьих лиц. <br>
            4.5. Принимая настоящие Правила путем регистрации на Сайте, Пользователь подтверждает свое согласие на обработку Администрацией
            его персональных данных, предоставленных при регистрации, а также размещаемых Пользователем добровольно на своей персональной
            странице. Обработка персональных данных Пользователя осуществляется в соответствии с законодательством Российской Федерации.
            Администрация сайта обрабатывает персональные данные Пользователя в целях предоставления Пользователю услуг, в том числе,
            в целях получения Пользователем, баннерной, текстовой и текстово-графической рекламы. Администрация сайта принимает все
            необходимые меры для защиты персональных данных Пользователя от неправомерного доступа, изменения, раскрытия или уничтожения.
            Администрация предоставляет доступ к персональным данным Пользователя только тем работникам, подрядчикам и агентам Администрации,
            которым эта информация необходима для обеспечения функционирования Сайта и предоставления Услуг Пользователю. Администрация
            сайта вправе использовать предоставленную Пользователем информацию, в том числе персональные данные, в целях обеспечения
            соблюдения требований действующего законодательства Российской Федерации (в том числе в целях предупреждения и/или
            пресечения незаконных и/или противоправных действий Пользователей). Раскрытие предоставленной Пользователем информации
            может быть произведено лишь в соответствии с действующим законодательством Российской Федерации по требованию суда,
            правоохранительных органов, а равно в иных предусмотренных законодательством Российской Федерации случаях. <br>
            4.6. Выбранные Пользователем логин и пароль являются необходимой и достаточной информацией для доступа Пользователя на Сайт.
            Пользователь несет полную ответственность за их сохранность, самостоятельно выбирая способ их хранения. <br>
            4.7. Если Пользователем не доказано обратное, любые действия, совершенные с использованием его логина и пароля,
            считаются совершенными соответствующим Пользователем. В случае несанкционированного доступа к логину и паролю и/или
            персональной странице Пользователя, или распространения логина и пароля Пользователь обязан незамедлительно сообщить об этом
            Администрации Сайта в установленном порядке. <h4>
              5. Уведомление об использовании файлов cookie </h4>
            Наш сайт, как и большинство других, использует файлы cookie и другие похожие технологии (веб-маяки, пиксельные тэги и т. п.),
            чтобы предоставлять услуги, наиболее отвечающие вашим потребностям, а также накапливать статистическую информацию для анализа
            и улучшения наших услуг и сайтов. Настоящее Уведомление об использовании cookie-файлов (далее — «Уведомление») является частью
            Политики о конфиденциальности. При использовании данного сайта, вы подтверждаете свое согласие на использование файлов cookie
            и других похожих технологий в соответствии с настоящим Уведомлением. Если вы не согласны, чтобы мы использовали данный тип
            файлов, вы должны соответствующим образом установить настройки вашего браузера или не использовать наш сайт (подробнее — в
            разделе «Как управлять файлами cookie»). <br>
            5.1. Что такое файл cookie и другие похожие технологии Файл cookie представляет собой небольшой текстовый файл, сохраняемый
            на вашем компьютере, смартфоне или другом устройстве, которое вы используете для посещения сайта. Некоторые из посещенных
            страниц могут также собирать информацию, используя пиксельные тэги и веб-маяки, представляющие собой электронные изображения,
            называемые одно-пиксельными (1×1) или пустыми GIF-изображениями. Файлы cookie могут размещаться на вашем устройстве нами
            («собственные» файлы cookie) или другими операторами (файлы cookie «третьих лиц»). Мы используем два вида файлов cookie
            на сайте: «cookie сессии» и «постоянные cookie». Cookie сессии — это временные файлы, которые остаются на устройстве пока
            вы не покинете сайт. Постоянные cookie остаются на устройстве в течение длительного времени или пока вы вручную не удалите
            их (как долго cookie останется на вашем устройстве будет зависеть от продолжительности или «времени жизни» конкретного файла
            и настройки вашего браузера). На основании этих файлов собирается информация, помогающая оценить эффективность наших услуг и
            сайтов и улучшить их. Например, чтобы узнать, когда вы посещаете наш сайт, как вы им пользуетесь, как взаимодействуете с
            рассылкой по электронной почте и другим контентом, запомнить ваши предпочтения, предоставить защищенное и безопасное
            обслуживание при онлайн-транзакциях и т. п. Информация, собираемая такими файлами и технологиями, носит обобщенный характер и
            не связана с идентификацией отдельных пользователей. Тем не менее, при покупке вами у нас конкретных продуктов и услуг, мы
            можем использовать предоставленные вами при сделке контактные данные в сочетании со сведениями, получаемыми благодаря файлам
            cookie и похожим технологиям, чтобы проанализировать, как вы используете наш сайт и улучшить его. Обработка таких контактных
            данных осуществляется нами в соответствии с Политикой о конфиденциальности. <br>
            5.2. Виды файлов cookie, которые могут использоваться на нашем сайте Обязательные файлы cookie. Эти файлы cookie позволяют
            вам посещать сайты и использовать их функции. Их отключение усложнит функционирование сайтов и может сделать недоступными
            их функции и сервисы. Файлы cookie, относящиеся к производительности, эффективности и аналитике. Эти файлы помогают нам понять,
            как пользователи взаимодействуют с нашим сайтом, показывают проблемы в его работе (например, сообщения об ошибках), помогают
            измерять эффективность наших рекламных кампаний и оптимизировать их для пользователей. Функциональные файлы cookie.
            Они помогают запоминать индивидуальные предпочтения пользователей и персонализировать для них содержание сайта.
            Рекламные файлы cookie. Они используются для доставки целевой рекламы и помогают нам оценивать эффективность рекламных кампаний.
            Мы можем делиться этими файлами с соответствующими рекламными системами и площадками, где размещается наша реклама.
            Сторонние веб-сервисы. Иногда на данном сайте мы используем сторонние веб-сервисы. Например, для отображения тех или
            иных элементов (изображения, видео, презентации и т. п.), организации опросов, оплаты продуктов и услуг через платежные
            системы и т. п. Как и в случае с кнопками доступа к социальным сетям, мы не можем препятствовать сбору этими сайтами или
            внешними доменами информации о том, как вы используете содержание сайта. <br>
            5.3. Как управлять файлами cookie? Большинство интернет-браузеров изначально настроены на автоматический прием файлов cookie.
            Вы можете изменить настройки вашего браузера таким образом, чтобы блокировать файлы cookie или предупреждать вас о том, когда
            они будут отправляться к вам на устройство (обратитесь к руководству использования конкретного браузера). Если вы используете
            несколько устройств и (или) браузеров для доступа в интернет, соответствующие настройки должны быть изменены в каждом из них.
            <br>
            5.4. Изменение условий использования файлов cookie По собственному усмотрению мы можем периодически изменять настоящее
            Уведомление. Изменения в Уведомлении вступают в силу с момента публикации новой редакции на сайте.
            Факт использования вами нашего сайта после внесения соответствующих изменений означает ваше согласие на принятие новой
            редакции Уведомления.
            <h4> 6. Соглашение об использовании платного контента Сайта </h4> Платный контент Сайта – обучающие материалы в различной
            форме, доступ к которым предоставляется после оплаты конкретный денежной суммы, размер который указывается непосредственно
            на странице с предложением. Настоящее раздел Условий об использовании является соглашением которое регламентирует отношения
            между Сайтом, предоставляющим ограниченному кругу зарегистрированных на сайте и оплативших соответствующую услуги лиц,
            возможность получать доступ к платному контенту Сайта и физическим лицом (далее Соглашение). <br>
            6.1. Пользователь гарантирует, что обладает всеми необходимыми полномочиями для заключения Соглашения.
            В случае, если Пользователь не достиг возраста совершеннолетия (18 лет) или стал полностью недееспособным в силу
            наступления иного обстоятельства, предусмотренного действующим законодательством, он обязан самостоятельно получить
            необходимое разрешение в требуемой законом форме от своих родителей, либо законных представителей. <br>
            6.2. Оформив доступ к платному контенту посредством совершения предусмотренных для этого действий, Пользователь гарантирует
            и подтверждает, что прочитал и выразил полное согласие (акцептовал) с условиями настоящего Соглашения без каких-либо изменений
            или изъятий. <br>6.3. Настоящее Соглашение является юридически обязывающим договором, определяющим условия и правила
            использования платного контента Сайта, предоставляющей расширенный доступ к его функционалу. <br>
            6.4. Соглашение считается заключенным и приобретает силу договора присоединения с момента совершения Пользователем действий,
            предусмотренных п.6.7 настоящих Условий, означающих полное и безоговорочное принятие Пользователем всех условий Соглашения
            без каких-либо изъятий и/или ограничений. Пользователь наравне с Администрацией становится Стороной по Соглашению. <br>
            6.5. Срок для принятия (акцепта) Соглашения не установлен. Соглашение может быть изменено Администрацией, при этом
            Администрация уведомляет Пользователя об изменении Соглашения путем размещения информации об изменении Соглашения на сайте.
            <br>6.6. При использовании Сайта в части платного контента Пользователи обязаны руководствоваться настоящим Соглашением. <br>
            6.7. Акцептом настоящего Соглашения как юридически обязывающего документа является принятие Пользователем его условий путем
            совершением действий по оплате платного контента согласно выбранным Пользователем условиям. <br>
            6.8. По истечении срока платного контента (если такой предусматривается предложением) доступ к соответствующим разделам Сайта
            становится недоступным. <br>6.9. Администрация вправе в любое время без уведомления Пользователя и без объяснения причин
            расторгнуть настоящее Соглашение в одностороннем внесудебном порядке с немедленным прекращением доступа и возможности
            использовать платный контент и без возмещения каких-либо затрат, убытков или возврата полученного по Соглашению. <br>
            6.10. Пользователь несет ответственность за действия, совершаемые при пользовании платного контента, в том числе за
            правильность действий и указание сведений согласно настоящему Соглашению. <br>
            6.11. Пользователь несет ответственность за правильность указания суммы платежа и всех запрашиваемых данных. <br>
            6 .12. Принимая во внимание, что Администрация фактически не осуществляет перевод денежных средств и не оказывает
            каких-либо банковских и (или) иных услуг по переводу средств, всю ответственность за правильность осуществления платежей
            несут исключительно банк-эмитент / оператор платежей (в том числе, операторы сотовой связи, если применимо) и Пользователь. <br>
            6.13. Стороны признают и соглашаются, что Администрация не отвечает за любые технические сбои или иные проблемы любых
            телефонных сетей или служб, компьютерных систем, серверов или провайдеров, компьютерного или телефонного оборудования,
            программного обеспечения, сбоев сервисов электронной почты или скриптов по техническим причинам. Также Администрация не
            отвечает за убытки, возникшие у Пользователя по причинам, связанным с техническими сбоями аппаратного или программного
            обеспечения. <br>
            6.14. Соглашение вступает в силу с момента выполнения Пользователем действий, предусмотренных п.5 Соглашения, и действует
            в течение неопределенного срока, но в пределах срока действия Пользовательского соглашения. <br>
            6.15. Настоящее Соглашение распространяет свое действие на все способы использования Пользователем платного контента
            на сайте, посредством любых устройств, как через интерфейс Сайта , так и через интерфейсы на мобильных устройствах.

            <h4> Контактная информация </h4>
            <br>Автор курсов и правообладатель сайта: Копанев Илья. <br>
            <br>email: class-courses@mail.ru </div></div></div>


        </div>
      </div>
    </div>


  </AuthenticatedLayout>
</template>
